# The DataFrame Data Structure

In [1]:
import pandas as pd

In [3]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [4]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [5]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [6]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [7]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [8]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [9]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [10]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [12]:
df.loc['Store 1']['Cost']         # chaining makes pandas returns 
#a copy of the dataframe instead of a view on the dataframe which is comparably slower

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [13]:
df.loc[:, ['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [15]:
df.drop('Store 1')    #returns a copy of the dataframe with the given rows removed

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [16]:
df   #.drop() doesn't change the original dataset

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [17]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [18]:
del copy_df['Name']
copy_df

        Item Purchased  Cost
Store 2      Bird Seed   5.0

In [19]:
df['Location'] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevyn   Kitty Litter   2.5     None
Store 2  Vinod      Bird Seed   5.0     None

In [22]:
df['Cost'] = df['Cost']*0.2
df['Cost'] *= 0.8
print(df)

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  0.72     None
Store 1  Kevyn   Kitty Litter  0.08     None
Store 2  Vinod      Bird Seed  0.16     None

In [21]:
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food   4.5     None
Store 1  Kevyn   Kitty Litter   0.5     None
Store 2  Vinod      Bird Seed   1.0     None